; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v5)
             (pred_10 ?v9 ?v2)
             (pred_6 ?v11 ?v2)
             (pred_2 ?v6 ?v11 )
	     (pred_12 ?v11)
             (pred_8 ?v13)
             (pred_3 ?v9)
             (pred_4 ?v2)
             (pred_5 ?v11)
             (pred_11 ?v9)
             (pred_7 ?v11)
             (pred_9 ))



(:action op_3
:parameters (?v7 ?v3 ?v8 ?v1)
:precondition (and (pred_8 ?v7) (pred_8 ?v3) (pred_3 ?v8) (pred_4 ?v1)
          (pred_1 ?v7 ?v3) (pred_10 ?v8 ?v1)
                   (pred_6 ?v3 ?v1) (pred_12 ?v7) 
                   (pred_5 ?v3) (pred_11 ?v8))
:effect (and  (pred_7 ?v3) (not (pred_5 ?v3))))


(:action op_5
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_8 ?v4)
               (pred_12 ?v7) (pred_1 ?v7 ?v4) (pred_7 ?v4))
:effect (and (pred_12 ?v4) (not (pred_12 ?v7))))

(:action op_2
:parameters (?v7 ?v8)
:precondition (and (pred_8 ?v7) (pred_3 ?v8) 
                  (pred_12 ?v7) (pred_2 ?v8 ?v7) (pred_9 ))
:effect (and (pred_11 ?v8)
   (not (pred_2 ?v8 ?v7)) (not (pred_9 ))))


(:action op_1
:parameters (?v7 ?v10 ?v12)
:precondition (and (pred_8 ?v7) (pred_3 ?v10) (pred_3 ?v12)
                  (pred_12 ?v7) (pred_11 ?v12) (pred_2 ?v10 ?v7))
:effect (and (pred_11 ?v10) (pred_2 ?v12 ?v7)
        (not (pred_11 ?v12)) (not (pred_2 ?v10 ?v7))))

(:action op_4
:parameters (?v7 ?v8)
:precondition (and (pred_8 ?v7) (pred_3 ?v8) 
                  (pred_12 ?v7) (pred_11 ?v8))
:effect (and (pred_9 ) (pred_2 ?v8 ?v7) (not (pred_11 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_27 obj_01 obj_23 obj_18 obj_10 obj_08 obj_20 obj_05 obj_22 obj_07 obj_12 obj_06 obj_19 obj_11 obj_28 obj_03 obj_29 obj_09 obj_02 obj_14 obj_30 obj_16 obj_15 obj_24
    obj_17 obj_26
    obj_25 obj_21 obj_13
    )

    (:init
       (pred_9)

       (pred_8 obj_04)
       (pred_8 obj_27)
       (pred_8 obj_01)
       (pred_8 obj_23)
       (pred_8 obj_18)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_05)
       (pred_8 obj_22)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_28)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_09)
       (pred_8 obj_02)
       (pred_8 obj_14)
       (pred_8 obj_30)
       (pred_8 obj_16)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_4 obj_17)
       (pred_4 obj_26)
       (pred_3 obj_25)
       (pred_3 obj_21)
       (pred_3 obj_13)

       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_27)
       (pred_1 obj_27 obj_08)
       (pred_1 obj_27 obj_01)
       (pred_1 obj_27 obj_04)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_01 obj_23)
       (pred_1 obj_01 obj_27)
       (pred_1 obj_23 obj_05)
       (pred_1 obj_23 obj_18)
       (pred_1 obj_23 obj_01)
       (pred_1 obj_18 obj_22)
       (pred_1 obj_18 obj_23)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_08 obj_27)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_20 obj_05)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_20 obj_08)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_22)
       (pred_1 obj_05 obj_23)
       (pred_1 obj_05 obj_20)
       (pred_1 obj_22 obj_11)
       (pred_1 obj_22 obj_18)
       (pred_1 obj_22 obj_05)
       (pred_1 obj_07 obj_28)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_06 obj_29)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_22)
       (pred_1 obj_11 obj_19)
       (pred_1 obj_28 obj_14)
       (pred_1 obj_28 obj_03)
       (pred_1 obj_28 obj_07)
       (pred_1 obj_03 obj_30)
       (pred_1 obj_03 obj_29)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_03 obj_28)
       (pred_1 obj_29 obj_16)
       (pred_1 obj_29 obj_09)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_29 obj_03)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_02 obj_24)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_14 obj_30)
       (pred_1 obj_14 obj_28)
       (pred_1 obj_30 obj_16)
       (pred_1 obj_30 obj_03)
       (pred_1 obj_30 obj_14)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_29)
       (pred_1 obj_16 obj_30)
       (pred_1 obj_15 obj_24)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_24 obj_02)
       (pred_1 obj_24 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_6  obj_19 obj_17)
       (pred_6  obj_07 obj_26)
       (pred_6  obj_05 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_27)
       (pred_7 obj_01)
       (pred_7 obj_23)
       (pred_7 obj_18)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_20)
       (pred_7 obj_22)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_28)
       (pred_7 obj_03)
       (pred_7 obj_29)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_14)
       (pred_7 obj_30)
       (pred_7 obj_16)
       (pred_7 obj_15)
       (pred_7 obj_24)

       (pred_10  obj_25 obj_17)
       (pred_10  obj_21 obj_26)
       (pred_10  obj_13 obj_26)
       (pred_2 obj_25 obj_12)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_13 obj_08)
       (pred_12 obj_18)
    )

    (:goal (and
       (pred_2 obj_25 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_06)))
)
)

; plan
1. (op_5 obj_18 obj_23)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_23)
   goals met: 0 of 1
2. (op_5 obj_23 obj_01)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_01)
   goals met: 0 of 1
3. (op_5 obj_01 obj_20)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_20)
   goals met: 0 of 1
4. (op_5 obj_20 obj_08)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_12)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_12)
   goals met: 0 of 1
6. (op_2 obj_12 obj_25)
   deleted: (pred_2 obj_25 obj_12) (pred_9)
   added: (pred_11 obj_25)
   goals met: 0 of 1
7. (op_5 obj_12 obj_03)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_03)
   goals met: 0 of 1
8. (op_5 obj_03 obj_29)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_29)
   goals met: 0 of 1
9. (op_5 obj_29 obj_09)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_09)
   goals met: 0 of 1
10. (op_4 obj_09 obj_25)
   deleted: (pred_11 obj_25)
   added: (pred_9) (pred_2 obj_25 obj_09)
   goals met: 1 of 1
